---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
source: html/f77557fc-2bc9-e1f9-5984-57cbbe93508a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed

Defines parameters for Hot Formed structural section.

## Syntax (C#)
```csharp
public class StructuralSectionColdFormed : StructuralSectionRectangular
```